In [2]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

### You are given the table viewership. Define "mobile" as the sum of table and phone viewership numbers. Write a query to compare the viewership on laptops vs mobile devices.

In [3]:
%%sql
SELECT * FROM viewership LIMIT 10;

 * postgresql://user:***@localhost:5432/postgres
10 rows affected.

[(101, 'mobile', datetime.datetime(2025, 7, 21, 13, 16, 46, 159072)),
 (102, 'desktop', datetime.datetime(2025, 7, 22, 13, 16, 46, 159072)),
 (103, 'tablet', datetime.datetime(2025, 7, 23, 13, 16, 46, 159072)),
 (104, 'mobile', datetime.datetime(2025, 7, 24, 13, 16, 46, 159072)),
 (105, 'desktop', datetime.datetime(2025, 7, 25, 13, 16, 46, 159072)),
 (106, 'tablet', datetime.datetime(2025, 7, 26, 13, 16, 46, 159072)),
 (107, 'mobile', datetime.datetime(2025, 7, 27, 13, 16, 46, 159072)),
 (108, 'desktop', datetime.datetime(2025, 7, 28, 13, 16, 46, 159072)),
 (109, 'tablet', datetime.datetime(2025, 7, 29, 13, 16, 46, 159072)),
 (110, 'mobile', datetime.datetime(2025, 7, 30, 13, 16, 46, 159072))]

In [22]:
%%sql
SELECT 
    SUM(CASE WHEN device_type = 'tablet' OR device_type = 'mobile' THEN 1 ELSE 0 END) AS mobile_devices,
    SUM(CASE WHEN device_type = 'desktop' THEN 1 ELSE 0 END) AS laptop_devices
FROM viewership

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[(33, 17)]